Revit 2027 API
Category.CanAddSubcategory Property
Indicates if subcategories can be assigned to the category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanAddSubcategory { get; }
Public ReadOnly Property CanAddSubcategory As Boolean
	Get
public:
property bool CanAddSubcategory {
	bool get ();
}
member CanAddSubcategory : bool with get
Property Value
Boolean
See Also
Reference
Category Class
Autodesk.Revit.DB Namespace